The constraints of the sketch defining the highlighted element cannot be satisfied.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId VarSketchInElementFailure { get; }
  Visual Basic
Public Shared ReadOnly Property VarSketchInElementFailure As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ VarSketchInElementFailure {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SketchFailures Class
  Autodesk.Revit.DB Namespace